# Remove Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipingSystem..::..Remove Method
PipingSystem Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Remove(ConnectorSet) | Removes connectors from system. (Inherited from MEPSystem.) |
| Remove(ICollection<(Of <<'(ElementId>)>>)) | Remove elements from system. (Inherited from MEPSystem.) |

# See Also
PipingSystem Class
PipingSystem Members
Autodesk.Revit.DB.Plumbing Namespace